# Contains Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
InsulationTypeSet..::..Contains Method
InsulationTypeSet Class See Also
---
Tests for the existence of a insulation type within the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Contains(
	InsulationType item
)
```

Visual Basic
---
```text
Public Overridable Function Contains ( _
	item As InsulationType _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Contains(
	InsulationType^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Electrical..::..InsulationTypeThe insulation type to be searched for.
# ### Return Value
The Contains method returns True if the insulation type is within the set, otherwise False.
# See Also
InsulationTypeSet Class
Autodesk.Revit.DB.Electrical Namespace